app/controllers/sub_tasks_controller.rb

SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def index
    @sub_tasks = SubTask.find(params[:ids])

INSERT INTO "sub_tasks" ("created_at", "done", "name", "task_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 25 Oct 2012 02:19:32 UTC +00:00], ["done", false], ["name", "Enter a name"], ["task_id", nil], ["updated_at", Thu, 25 Oct 2012 02:19:32 UTC +00:00]]
---
  def create
    task_id = params[:sub_task].delete(:task_id)
    @sub_task = SubTask.new(params[:sub_task])
    @sub_task.task_id = task_id
    @sub_task.save

SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."id" = $1 LIMIT 1  [["id", "9"]]
UPDATE "sub_tasks" SET "name" = 'Clean up thingsfdsafds', "updated_at" = '2012-10-25 14:08:49.551057' WHERE "sub_tasks"."id" = 9
---
  def update
    @sub_task = SubTask.find(params[:id])
    params[:sub_task].delete(:task_id)
    @sub_task.update_attributes(params[:sub_task])