app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY created_at
---
  def index
    respond_with Task.order('created_at').all

SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."task_id" = 5
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    render json: Task.find(params[:id])

INSERT INTO "tasks" ("created_at", "done", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 23 Oct 2012 15:07:49 UTC +00:00], ["done", nil], ["name", "Finish this talk"], ["updated_at", Tue, 23 Oct 2012 15:07:49 UTC +00:00]]
---
  def create
    @task = Task.new(params[:task])
    @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "name" = 'Finish this talk ha!', "updated_at" = '2012-10-23 16:15:10.932051' WHERE "tasks"."id" = 1
---
  def update
    @task = Task.find(params[:id])
    @task.update_attributes(params[:task])

SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."task_id" = 4
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", "6"]]
DELETE FROM "sub_tasks" WHERE "sub_tasks"."id" = $1  [["id", 9]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 6]]
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy